Repository: deepin-community/ibus-chewing
Catalog: po/*.po
Languages: cs

source: Editing
cs: Editace

source: Selecting
cs: Výběr

source: Keyboard
cs: Klávesnice

source: default
cs: výchozí

source: dvorak
cs: dvořák

source: dvorak_hsu
cs: dvořák_hsu

source: no default
cs: žádné výchozí

source: lowercase
cs: malá písmena

source: uppercase
cs: velká písmena

# Sync
source: disable
cs: zakázat

# Sync
source: keyboard
cs: klávesnice

# Sync
source: input method
cs: metoda vstupu

source: Auto
cs: automaticky

source: Keyboard Type
cs: Typ klávesnice

source: Select Zhuyin keyboard layout
cs: Vyberte rozložení klávesnice Zhuyin

source: Selection keys
cs: Výběrové klávesy

source: Keys used to select candidate. For example "asdfghjkl;", press 'a' to select the 1st candidate, 's' for 2nd, and so on.
cs: Klávesy sloužící k výběru kandidáta. Například "asdfghjkl;", stiskni 'a' pro výběr 1. kandidáta, 's' pro výběr 2. a tak dále.

source: Hsu's selection key
cs: Výběrová klávesa pro Hsu

source: Hsu's keyboard selection keys, 1 for asdfjkl789, 2 for asdfzxcv89 .
cs: Klávesy pro výběr Hsu klávesnice, 1 pro asdfjkl789, 2 pro asdfzxcv89 .

source: Show systray icons
cs: Zobrazit ikony nástrojové lišty

source: On: Show Chinese/English and Full/Half shape status as a systray icon Off: Do not show the status icon
cs: Zapnuto: zobrazovat čínské/anglické a plný/částečný stav tvaru jako ikonu nástrojové lišty Vypnuto: nezobrazovat ikonu stavu

source: Auto move cursor
cs: Automatický pohyb kurzoru

source: Automatically move cursor to next character
cs: Automaticky přesunout kurzor na další znak

source: Add phrases to the front
cs: Přidat sousloví do popředí

source: Clean pre-edit buffer when focus out
cs: Vyčistit přededitační vyrovnávací paměť jakmile vyjde z fokusu

source: On: Clean pre-edit buffer when focus out to prevent program crash Off: Keep what you already type for convenience
cs: Zapnuto: Vyčistit přededitační vyrovnávací paměť jakmile vyjde z fokusu pro prevenci pádu programu Vypnuto: Zachovat to, co už bylo napsáno pro usnadnění

source: Easy symbol input
cs: Snadný vstup symbolů

source: Press shift to input Chinese punctuation symbols
cs: Stisknout shift pro vložení čínského interpunkčního znaménka

source: Esc clean all buffer
cs: Esc vyčistí celou vyrovnávací paměť

source: Escape key cleans the text in pre-edit-buffer
cs: Escape klávesa vyčistí text v přededitační vyrovnávací paměti

source: Maximum Chinese characters
cs: Maximum čínských znaků

source: Maximum Chinese characters in pre-edit buffer, including inputing Zhuyin symbols.
cs: Maximum čínských znaků v přededitační paměti včetně vkládání symbolů Zhuyin.

source: Sync between CapsLock and IM
cs: Sync mezi CapsLock a IM

source: Occasionally, the CapsLock status does not match the IM, this option determines how these status be synchronized. Valid values: "disable": Do nothing "keyboard": IM status follows keyboard status "IM": Keyboard status follows IM status
cs: Příležitostně, stav CapsLock neodpovídá IM, tato volba určuje, jak synchronizovat tyto stavy. Platné hodnoty: "vypnout": Nedělat nic "klávesnice": Stav IM následuje stav klávesnice. "IM": Stav klávesnice následuje stav IM.

source: Number pad always input number
cs: Číselná klávenice vždy vkládá číslo

source: Always input numbers when number keys from key pad is inputted
cs: Vždy vložit čísla, pokud jsou stisknuty číselné klávesy

source: Shift toggle Chinese Mode
cs: Shift přepíná režim čínštiny

source: Shift key to toggle Chinese Mode
cs: Shift klávesa přepíná čínský režim

source: Caps Lock toggles Chinese Mode
cs: Klávesa Caps Lock přepíná čínský mód

source: On: Caps Lock toggle Chinese/English Off: Caps Lock only affect English letter case
cs: Zapnuto: Caps Lock přepíná čínštinu/angličtinu Vypnuto: Caps Lock má vliv pouze na anglická malá a velká písmena

source: Default English letter case (Only effective when Caps Lock toggles Chinese is ON)
cs: Výchozí hodnota anglických velkých a malých písmen (Efektivní pouze pokud Caps Lock přepíná čínštinu na aktivní)

source: no control: No default letter case. Not recommend if you use multiple keyboards or synergy lowercase: Default to lowercase, press shift for uppercase. uppercase: Default to uppercase, press shift for lowercase.
cs: žádná kontrola: Žádná výchozí velikost písmen. Není doporučeno v případě použití více klávesnic nebo synergie malá písmena: Výchozí jsou malá písmena, stisknout shift pro velká písmena. velká písmena: Vychozí jsou velká písmena, stisknout shift pro malá písmena.

source: Plain Zhuyin mode
cs: Prostý režim Zhuyin

source: In plain Zhuyin mode, automatic candidate selection and related options are disabled or ignored.
cs: V prostém režimu Zhuyin jsou automatický výběr kandidátů a související možnosti deaktivovány nebo ignorovány.

source: Candidate per page
cs: Kandidát na stránku

source: Number of candidate per page.
cs: Počet kandidátů na stránku

source: Choose phrases from backward
cs: Vybírat sousloví zpětně

source: Choose phrases from the back, without moving cursor.
cs: Vybírat sousloví odzadu, bez pohybu kurzoru.

source: Space to select
cs: Klávesa Space pro výběr

source: Left click to toggle Chi/Eng; Right click to toggle full/half shape
cs: Kliknout levým tlačítkem pro přepnutí Čínštiny/Angličtiny; kliknutí pravým přepíná plný/částečný tvar

# Configure
source: Cancel
cs: Zrušit

# Configure
source: Save
cs: Uložit

# Configure
source: Apply
cs: Aplikovat

# Configure
source: Close
cs: Zavřít

source: Setting
cs: Nastavení

source: Cannot connect to IBus!
cs: Nelze se připojit k IBus!

source: Chewing component
cs: Součást Chewing

source: Chinese chewing input method
cs: Metoda zadávání čínštiny
